{"count":47,"next":null,"previous":null,"results":[{"code":"37CLM9","name":"David Cortes","biography":null,"submissions":["D78ZJP"],"answers":[]},{"code":"3U3KUU","name":"Anuradha KAR","biography":"I am an Associate Professor in AI and Robotics at Aivancity based in Paris, France.  I got my PhD from the University of Galway in Ireland in Electrical and Electronic Engineering. I then worked at ENS Lyon in collaboration with Inria and Inrae on deep learning for 3D biological image analysis, then joined the Paris Brain Institute with Inria on deep learning for data analysis of Alzheimer's patients, and the Pasteur Institute in Paris on applications of deep learning in the field of drug discovery. My research and teaching interests focus on applications of deep learning in computer vision, computational biology and health, as well as human-machine interactions and intelligent systems.","submissions":["MLCQQL","Q3FERF"],"answers":[390935,390936,390937,390939]},{"code":"8EGVC9","name":"Cheuk Ting Ho","biography":"After having a career as a Data Scientist and Developer Advocate, Cheuk dedicated her work to the open-source community. Currently, she is working as an AI developer advocate for JetBrains. She has co-founded Humble Data, a beginner Python workshop that has been happening around the world. She has served the EuroPython Society board for two years and is now a fellow and director of the Python Software Foundation.","submissions":["Z83QKH"],"answers":[382226,382227,382228,382263,382264,382265,382266]},{"code":"8LQU9C","name":"Florian Wilhelm","biography":"Florian is Head of Data Science & Mathematical Modeling at inovex GmbH, an IT project center driven by innovation and quality, focusing its services on ‘Digital Transformation’. He holds a PhD in mathematics, has more than 10 years of experience in predictive & prescriptive analytics use-cases and likes everything math 🤯","submissions":["ZRA3GV"],"answers":[376044,376045,376046,376048,376049,376050,376051]},{"code":"8YYMWZ","name":"Ole Bialas","biography":"I studied Biology at the University of Tübingen, where I first learned how to code using Matlab. Then, I moved to Leipzig, where I did a master’s degree and later a PhD in neurobiology. In my research, I studied how the brain processes sound location using electroencephalography (EEG) and custom experimental setups for spatial audio. During that time, I started using Python and eventually co-authored “slab”, a Python toolbox for psychoacoustic experiments. After my PhD, I moved to the University of Rochester in New York, where I studied how the brain processes naturalistic speech by modeling EEG that was recorded while the participants listened to audiobooks. For this research I published another toolbox, originally written in Matlab, called “mTRFpy”. As my postdoc was coming to an end, I was looking for a position where I could combine my interest in neuroscience with my passion for programming. I found such a position at the University Clinic Bonn where I currently work as a research software consultant. In this position, I develop and teach workshops where neuroscience researchers can improve their software skills. I also do one-on-one consulting to help neuroscientists deal with the computational challenges they are faced in their research.","submissions":["HUTEDK"],"answers":[391085,391086,391088,391089,391090,391091,391092]},{"code":"98HJFS","name":"Anatoly Volkov","biography":"I am the developer of the open-source libraries https://github.com/uxlfoundation/oneDAL and https://github.com/uxlfoundation/scikit-learn-intelex , which provide optimized implementations of classical machine learning algorithms.","submissions":["D78ZJP"],"answers":[382422,382423,382425,382426]},{"code":"9WJJPL","name":"Stefanie Molin","biography":"[Stefanie Molin](https://stefaniemolin.com) is a software engineer at Bloomberg in New York City, where she tackles tough problems in information security, particularly those revolving around data wrangling/visualization, building tools for gathering data, and knowledge sharing. She is also a core developer of [numpydoc](https://github.com/numpy/numpydoc) and the author of “[Hands-On Data Analysis with Pandas: A Python data science handbook for data collection, wrangling, analysis, and visualization](https://www.amazon.com/Hands-Data-Analysis-Pandas-visualization/dp/1800563450),” which is currently in its second edition and has been translated into Korean and Chinese. She holds a bachelor’s of science degree in operations research from Columbia University's Fu Foundation School of Engineering and Applied Science, as well as a master’s degree in computer science, with a specialization in machine learning, from Georgia Tech. In her free time, she enjoys traveling the world, inventing new recipes, and learning new languages spoken among both people and computers.","submissions":["GYBLDL"],"answers":[381357,381358,381359,381361,381362,381363,381364]},{"code":"AHZXBV","name":"Ada Böhm","biography":"Ada is a Rust and Python developer. She is a tool builder in various areas, including schedulers for clusters, tools to support AI experiments, or a tool to create slides . She is an active contributor to several open source projects. Ada has a PhD in Computer Science.","submissions":["7BXY7G"],"answers":[381123,381125,381126,381127]},{"code":"BKUYND","name":"Revathy Venugopal","biography":null,"submissions":["SNPKGF"],"answers":[]},{"code":"BMFCA3","name":"Francesc Alted","biography":"I am a curious person who studied Physics and Applied Maths. I spent over a year at [CERN](https://home.cern) for my MSc in High Energy Physics. However, I found maths and computer sciences equally fascinating, so I left academia to pursue these fields. Over the years, I developed a passion for handling large datasets and using compression to enable their analysis on commodity hardware accessible to everyone.\r\n\r\nI am the CEO of [ironArray SLU](https://ironarray.io) and also leading the [Blosc Development Team](https://blosc.org). I am very excited in working in providing a way for sharing Blosc2 datasets in the network in an easy and effective way via [Caterva2](https://ironarray.io/caterva2-doc/index.html), and [Cat2Cloud](https://ironarray.io/cat2cloud), a software as a service that we are introducing.\r\n\r\nAs an Open Source believer, I started the [PyTables project more than 20 years ago](https://www.blosc.org/posts/pytables-20years/).  After 25 years in this business, I started several other useful open source projects like Blosc, Caterva2 and [Btune](https://github.com/ironArray/Blosc2-Btune); those efforts won me two prizes that mean a lot to me:\r\n\r\n* 2023: [NumFOCUS Project Sustainability Award](https://www.blosc.org/docs/NumFOCUS-Sustainability-Award.jpg)\r\n* 2017: [Google’s Open Source Peer Bonus](https://opensource.googleblog.com/2017/10/more-open-source-peer-bonus-winners.html)\r\n\r\nYou can know more on what I am working on by reading my [latest blogs](https://www.blosc.org/authors/francesc-alted).","submissions":["TP8ZB7","FPYRSB"],"answers":[381907,381908,381909,381911,381912,381913,381914,381915]},{"code":"BZSA9C","name":"Adam Staniszewski","biography":"I am a fifth-year computer science student at AGH University of Science and Technology (AGH UST) in Kraków, Poland, where I am currently conducting research in the fields of Natural Language Processing (NLP) and Chemoinformatics. My academic work is focused on developing innovative solutions that leverage computational techniques to analyze language data and chemical information. In addition to my studies, I am professionally working as a backend engineer, where I develop, and maintain server-side applications, ensuring scalability, efficiency, and reliability of systems. This combination of research and industry experience allows me to stay on the cutting edge of technology while applying practical solutions to real-world problems.","submissions":["8U3PB3"],"answers":[382325,382326]},{"code":"C9GEJ3","name":"Ricardo Vieira","biography":null,"submissions":["LR7S8P"],"answers":[]},{"code":"CERHSS","name":"Michał Szczepanik","biography":null,"submissions":["HUTEDK"],"answers":[391383,391384,391386,391387,391388]},{"code":"CLXJRK","name":"Manuel Jürgensen","biography":"Engineer and PhD student at BMW Group in cooperation with FAU Erlangen-Nuremberg, specializing in radar signal processing and perception with a focus on deep learning. Currently developing a Python framework for large-scale radar data generation.","submissions":["ELXEN7"],"answers":[382073,382074,382075,382077,382078]},{"code":"CSFTCQ","name":"Jost Migenda","biography":"Jost is a Senior Research Software Engineer at King’s College London, where they work on software projects ranging from astrophysics to Trusted Research Environments for analysing medical data. They are a certified Carpentries instructor and regularly develop and deliver training courses.\r\nJost received a PhD in astroparticle physics from the University of Sheffield and is a maintainer of several widely used supernova neutrino codes, including [SNEWPY](https://joss.theoj.org/papers/10.21105/joss.03772) and [sntools](https://joss.theoj.org/papers/10.21105/joss.02877).","submissions":["7XUYKH"],"answers":[381863,381864,381865,381867,381868]},{"code":"CVFFNV","name":"Jon Nordby","biography":"Jon is a Machine Learning Engineer specialized in IoT systems. He has a Master in Data Science and a Bachelor in Electronics Engineering, and has published several papers on applied Machine Learning.\r\nHe has been contributing to open-source software since 2010.\r\n\r\nThese days Jon is co-founder and Head of Data Science at Soundsensing, a leading provider of condition monitoring solutions for commercial buildings and HVAC systems.\r\nHe is also the creator and maintainer of emlearn, an open-source Machine Learning library for microcontrollers and embedded systems.","submissions":["TAXVPC"],"answers":[391145,391146,391148,391149]},{"code":"DMPC8P","name":"Janos Gabler","biography":"Author of optimagic | Head of TransferLab at appliedAI | Expert in numerical optimization | Building Bandsaws, Pizza Ovens and Furniture","submissions":["NKLD7R"],"answers":[390500,390501,390502,390504,390505,390506]},{"code":"E3S7GV","name":"Riccardo Cappuzzo","biography":null,"submissions":["8KK8UC"],"answers":[]},{"code":"EE7H7J","name":"Jacob Tomlinson","biography":"Jacob Tomlinson is a senior software engineer at NVIDIA. His work involves maintaining open source projects including RAPIDS and Dask. He also tinkers with kr8s in his spare time. He lives in Exeter, UK.","submissions":["CBPMEK"],"answers":[382357,382358,382360,382361,382362,382363,382364]},{"code":"EQJWS9","name":"Kai Striega","biography":"Kai is a senior software engineer and open source contributor with a focus on scientific computing and mathematical optimization. He currently works at Cartesian Software in Sydney, Australia, where he develops high-performance tools for solving large-scale linear programming problems. With a background in both software engineering and applied mathematics, his work bridges the gap between research-grade algorithms and production-ready systems.\r\n\r\nHe is an active member of the scientific Python ecosystem and a passionate advocate for sustainable open source development. His contributions span core libraries, tooling, and infrastructure that support numerical analysis, data workflows, and optimization.","submissions":["QPF9N7"],"answers":[396547,396548,396549,396551,396552,396553,396554]},{"code":"EVNBNX","name":"Piotr Ludynia","biography":"I am a data science and computer science student at AGH University of Kraków. My primary interests include machine learning and chemoinformatics.","submissions":["CTCYRB"],"answers":[380636,380638,380639]},{"code":"FGEUGZ","name":"Grzegorz Bokota","biography":"I have joined to napari project while working on PhD project, as I understand that great visualization significantly improves data understanding, so improves the quality of research. Now I'm shifting into full-time open-source contributor. I'm mainly focusing now on improving tooling to lower entry level. \r\nOn university, I teach students about Python.","submissions":["PTLGMW"],"answers":[382588,382589,382591,382592,382593,382594,382595]},{"code":"GWQHEL","name":"Likhita Yerra","biography":"Likhita Yerra, a Master’s student in AI and Data Science, specializes in Python, computer vision, and large language models. I develop innovative machine learning solutions with PyTorch, TensorFlow, Docker, and Streamlit, passionate about advancing AI and scientific computing for real-world impact.","submissions":["MLCQQL","Q3FERF"],"answers":[391489,391490,391492,391493,391494,391495]},{"code":"HYA9JW","name":"Samarth Bachkheti","biography":"Samarth Bachkheti is a geophysicist and AI practitioner specializing in seismic imaging, quantitative interpretation, and geomechanical assessment for offshore energy projects. With expertise in machine learning applications for geoscience, he leads the development of deep-learning tools for seabed imaging and offshore site assessments. His recent work focuses on deep learning for underwater object detection, integrating AI into geophysical workflows to enhance efficiency and accuracy in offshore engineering. He has presented at industry conferences and actively collaborate with research institutions to advance AI adoption in geoscience.","submissions":["9F88K8"],"answers":[381803]},{"code":"KMDJAL","name":"Guillaume Lemaitre","biography":"I'm chief machine learning officer and open source software engineer at :probabl. I'm a core developer of scikit-learn and imbalanced-learn.","submissions":["8KK8UC","ASR3XL"],"answers":[382688,382448,382689,382690,382691,382450]},{"code":"L3QKJA","name":"Lucas Colley","biography":"I am an undergraduate student studying Computer Science & Philosophy at the University of Oxford. I am also a maintainer of SciPy and array-api-extra, a member of the Consortium for Python Data API Standards, and a founding member of quantity-dev.","submissions":["X9TUZ8","NHKMDP"],"answers":[377033,377034,377036,377037,379791,377038]},{"code":"LR7MWP","name":"Jesse Grabowski","biography":"Doctoral Candidate - University of Paris I: Panthéon-Sorbonne\r\nTrilingual economist and data scientist with experience in North America, Africa, Europe, and Asia.","submissions":["LR7S8P"],"answers":[381480,381481,381483,381484,381485]},{"code":"N7TBEV","name":"Loïc Estève","biography":"Loïc has a Particle Physics background, which is how he discovered Python towards the end of his PhD.\r\n\r\nHe is a scikit-learn and joblib core contributor and has been involved in a number of Python open-source projects in the past 10 years, amongst which Pyodide, dask-jobqueue, sphinx-gallery and nilearn.","submissions":["LNU8UV"],"answers":[387830,387831,387833,387834]},{"code":"NEUMLP","name":"Olivier Grisel","biography":"Olivier Grisel is a machine learning engineer at Probabl and a contributor to the scikit-learn library.","submissions":["ASR3XL"],"answers":[]},{"code":"NQ9HEX","name":"Tiziano Zito","biography":null,"submissions":["MDVAHD"],"answers":[390814,390816]},{"code":"NYVKBG","name":"Francesco Bonazzi","biography":"Highly skilled Software Engineer and Data Scientist at Intesa Sanpaolo Bank, based in Milan, Italy. With a strong foundation in computational subjects, I hold a PhD in Physics with a specialization in computational modelling of biophysical processes. Having transitioned to the banking sector, I have applied my expertise to drive innovation in financial-related projects for numerous years. Additionally, I contribute to the open-source community as a maintainer and developer of the SymPy library, a widely-used computer algebra system.","submissions":["EAAE9B"],"answers":[382026,382027,382028,382029]},{"code":"PLJAZV","name":"Juan Luis Cano Rodríguez","biography":"Juan Luis (he/him/él) is an Aerospace Engineer with a passion for tech communities and sustainability. He works at QuantumBlack, AI by McKinsey, as Product Manager for Kedro, an open source Python framework for reproducible, maintainable and modular data science code. He has worked as Developer Advocate at Read the Docs, as software engineer in the space, consulting, and banking industries, and as a Python trainer for several private and public entities.\r\n\r\nApart from being a long-time user and contributor to many projects in the scientific Python stack (NumPy, SciPy, Astropy) he has published several open-source packages, the most important one being poliastro, an open-source Python library for interactive astrodynamics used in academia and industry.\r\n\r\nFinally, Juan Luis is the founder and former chair of the Python España association, the point of contact for the Spanish Python community, former organizer of PyCon Spain, and current organizer of the PyData Madrid monthly meetups.","submissions":["L9JPZE"],"answers":[385326,385328,385329,385330]},{"code":"QKVYNA","name":"Sebastian Berg","biography":"Sebastian has been a NumPy developer for about 10 years now.  After a PhD in phsyics he worked at as a postdoc at the Berkeley Institute for Datascience on NumPy as grants byt the Alfred P. Sloan Foundation and the Gordon and Betty Moore Foundation.  Since 2022 he has been a software engineer at NVIDIA where he continues to contribute to NumPy.","submissions":["9LAVJW"],"answers":[381943,381944,381946]},{"code":"RCGPHK","name":"Jakub Adamczyk","biography":"I am a PhD candidate in Computer Science at AGH University of Krakow, and a member of Graph ML and Chemoinformatics Lab at Faculty of Computer Science. My research concerns fair evaluation, graph representation learning, graph classification, chemoinformatics, and molecular property prediction. I'm also interested in time series, NLP, and MLOps, and I'm also teaching all of those things at AGH. I also work at Placewise as Data Science Engineer, focusing on various ML problems in tabular learning, CV and NLP, and their end-to-end MLOps. Beside my professional work, I train Historical European Martial Arts (HEMA) with messer and longsword, and like reading and tabletop RPGs.","submissions":["T88GQE"],"answers":[377799,377800,377801,377803,377804,377805]},{"code":"RMNGAJ","name":"Aditi Juneja","biography":"Hi, I am Aditi. I mostly work around API dispatching things in the scientific python ecosystem, mostly in NetworkX, nx-parallel backend and scikit-image.\r\n\r\nGitHub: https://github.com/Schefflera-Arboricola\r\nPrevious talks: https://github.com/Schefflera-Arboricola/blogs/tree/main/archive","submissions":["9LAVJW"],"answers":[]},{"code":"SA7KZA","name":"Davide De Marchi","biography":"Davide De Marchi is a researcher and software engineer specializing in geospatial big data. He has significant experience in Big Data, Cloud Computing, GIS, Remote Sensing,  and Data Visualization.  His career includes contributions to the design and implementation of interactive visualization tools, notably at the European Commission - Joint Research Centre where he has been a key developer of the BDAP platform.  Earlier in his career, he gained substantial experience in the development of geospatial data processing software and served as an adjunct professor at the University of Urbino","submissions":["GQBY9V"],"answers":[391061,391062,391064,391065,391066,391067,391068]},{"code":"VEXNNV","name":"Jakob Zahn","biography":"I studied Physics at Technische Universität Dresden and Freie Universität Berlin.\r\nAfter achieving my master's degree in 2021, I started working at Technische Universität Berlin in the ELVA project as technical lead and software developer.","submissions":["MDVAHD"],"answers":[390795,390796,390797,390799,390800]},{"code":"WFFNSW","name":"Luke Shaw","biography":"2019 BS in Physics (Princeton University), cum laude\r\n2020 MSc in Applied Mathematics (University of Edinburgh), with distinction\r\n2024 PhD in Applied Mathematics (Universitat Jaume I), sobresaliente cum laude","submissions":["TP8ZB7","FPYRSB"],"answers":[]},{"code":"WQZFDC","name":"Przemek","biography":"Web & mobile security researcher with a few years of experience. MSc in computer sciences. Currently working on network security, including kubernetes infrastructure. In free time doing hackthebox, sharing knowledge and analysing applications in Apple ecosystem.","submissions":["CHDNML"],"answers":[380755]},{"code":"WTK33D","name":"Mridul Seth","biography":null,"submissions":["K9L3VH"],"answers":[391185,391186,391188,391189]},{"code":"XBBD7M","name":"Anna Lührs","biography":"After obtaining her master degree in technomathematics in 2013, Anna Lührs joined the (former) division HPC in Neuroscience at Jülich Supercomputing Centre (JSC), for which she also acted as deputy lead, initially as research associate focusing on image segmentation on GPU clusters. She shifted her focus towards project management, research coordination and science communication for her department and the Human Brain Project, an EU-funded project with more than 100 project partners and a total duration of 10 years. Anna now works in and is deputy lead of the Office for (Inter)national Coordination and Networking at the JSC, which she joined 2023.","submissions":["BTXXNU"],"answers":[409907,409908,409909,409911,409912,409913,409914]},{"code":"YZAGH8","name":"Jan Boelts (Teusen)","biography":"Jan initially immersed himself in the realms of cognitive science and computational neuroscience. However, he couldn’t resist the siren call of Bayesian machine learning, and his PhD evolved into a mission to enhance the user-friendliness of this complex field. He set out to bridge cutting-edge methods with user-friendly software, making the world of simulation-based inference more accessible for practitioners. In 2024, he joined the TransferLab, ready to continue his journey of making advanced methodologies approachable and transformative.","submissions":["MU9HAJ","KCYYTF"],"answers":[382175,382176,382177,382179,382180,382181]},{"code":"Z9BZMS","name":"Anuradha Kar, PhD","biography":null,"submissions":["MLCQQL","Q3FERF"],"answers":[]},{"code":"Z9XNXN","name":"Lorenzo","biography":null,"submissions":["PTLGMW"],"answers":[382940,382941,382942,382944]},{"code":"ZDDWRW","name":"Maternus Herold","biography":"Applied AI Researcher focussing on uncertainty quantification and Bayesian inference in various industrial settings.","submissions":["MU9HAJ"],"answers":[382826,382827,382828,382830,382831,382832]},{"code":"ZHUVWQ","name":"Jérôme Dockès","biography":"Jérôme Dockès is a research engineer at Inria and one of the developers of the Skrub and Nilearn python packages.","submissions":["8KK8UC"],"answers":[382201,382202,382203,382205]},{"code":"ZVRV3Y","name":"Igor Tatarnikov","biography":"Igor Tatarnikov is a Research Software Engineer at University College London’s Sainsbury Wellcome Centre, where he aspires to create easy to use software tools for neuroscientists with a focus on image analysis.\r\n \r\nIgor holds a BSc in Microbiology and Immunology and an MSc in Neuroscience from the University of British Columbia (Vancouver, Canada), as well as a Bachelor in Computer Science from Dalhousie University (Halifax, Canada). For his MSc, Igor explored the electrophysiological characteristics of genetic mouse models of Parkinson’s disease. Igor’s multidisciplinary background is particularly useful for his current work, where he creates open-source tools for neuroanatomical image analysis.","submissions":["JACK7B"],"answers":[391295,391296,391297,391299]}]}